---
kind: method
id: M:Autodesk.Revit.DB.Electrical.ConduitSizes.Dispose
source: html/8a4cf40d-d979-8dbe-6d21-41d11b4b5aef.htm
---
# Autodesk.Revit.DB.Electrical.ConduitSizes.Dispose Method

Releases all resources used by the ConduitSizes

## Syntax (C#)
```csharp
public void Dispose()
```